{
  "Format": "2.8.0",
  "Changes": [
    // chinsam
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueSam",
      "Entries": {
        "Indoor_Day_5": "$y 'Babe, should I pick up rapping for our band? I will be spitting bars in no time._That would be cool._Nice. You will be my first audience!_No, please_Oh... Okay.'",
        "Indoor_Day_6": "I hope you are not lactose intolerant.#$b#Because I can be... a bit cheesy... [424]$h",
        "Outdoor_5": "Hey, @. I gotta practice my crazy skateboarding skills. Do you think I would be able to nail consecutive backflips? #$q 305/306 skateboardquestion_followup#How many backflips do you think I will pull off today?#$r 305 skateboardquestion_one#1#$r 305 skateboardquestion_ten#10#$r 306 skateboardquestion_ss#67",
        "skateboardquestion_one": "Damn, you need to have more faith in me.$3",
        "skateboardquestion_ten": "That many? Okay!$h",
        "skateboardquestion_ss": "Haha, you're so funny babe. Don't go bald.$10",
        "skateboardquestion_followup": "$p 306 #No but genuinely, don't go bald. Unless if you want to.$h|Wish me luck!",
        "fall_11": "Hey... Happy birthday, dear. [201]$l#$b#You are a hard working lady, but I wish you were more gentle to yourself sometimes. You have done enough, you know.#$b#I can't just tell you to stop worrying about things, because that's the person you are, but at least, know that I will be here with you.#$b#I hope that you will have a bombastic birthday! I love you.$h"
        }
    },
    // fweabastian
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueSebastian",
      "Entries": {
        "fall_23": "Hey, psst, silly. This is for you. [228]#$b#Happy birthday... Thank you for being with me.$l#$b#Sorry if I'm being weird, I don't do this often. Please forgive your awkward man.$h"
        }
    },
    
    // cucrobus
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueKrobus",
      "Entries": {
        "Indoor_Day_5": "I have heard a strange rumour lately...#$b#Um, it's nothing special. You just happen to be a funny person and I will make sure you don't go bald.",
        "Indoor_Day_6": "In a hundred of years, you, too, would cease to exist.#$b#In a millenia, the flower field as we know it will have long turned to ashes, and all the people and the sceneries and the places we have loved and held dearly would be here no longer, disintegrated, atomized, transubstantiated.#$b$But in the demise of all things lies rebirth. So I hope when that day comes, we will meet again on a flower field.$h",
        "Indoor_Night_5": "I overheard from next door... somebody was saying 'Let's get freaky!' I wonder what that means...?#$b#I think freaks are people who are kind of weird? You accepted me, so are you considered a freak...?#$e#We can be freaks together.$h",
        "winter_20": "Good morning, @. Happy birthday! [204]$h#$b#I have had happy days living with you, and I hope you did too...#$b#I heard when two humans really love each other, they hug. So I want to give you a lot of hugs.$h"
      }
    }
  ]
}
